import 'package:flutter/material.dart';

class data {
  static List catagory = [
    "शुभकामनाये शायरी",
    "दोस्ती शायरी",
    "मजेदार शायरी",
    "भगवान शायरी",
    "प्रेरक स्त्रोत शायरी",
    "जीवन शायरी",
    "महोबत शायरी",
    "याद शायरी",
    "दूसरी शायरी",
    "राजनीति शायरी",
    "प्रेम शायरी",
    "दर्द शायरी",
    "शराब शायरी",
    "बेवफा शायरी",
    "जन्मदिन शायरी",
    "होली शायरी"
  ];

  static List img = [
    "image/1.jpg",
    "image/2.jpg",
    "image/3.jpg",
    "image/4.jpg",
    "image/5.jpg",
    "image/6.jpg",
    "image/7.jpg",
    "image/8.jpg",
    "image/9.jpg",
    "image/10.jpg",
    "image/11.jpg",
    "image/12.jpg",
    "image/13.jpg",
    "image/14.jpg",
    "image/15.jpg",
    "image/16.jpg"
  ];

  static List shubh = [
    """ये रात चाँदनी बनकर आँगन में आये,
ये तारे लोरी गा कर आपको सुनाएं,
आयें आपको इतने प्यारे सपने यार...
कि नींद में भी आप हलके से मुस्कुराएं।
""",
    """ईश्वर न करे आपको कोई ग़म हो,
और सिर्फ खुशियाँ और हँसी मिले,
ग़म जब भी बढ़ चले आपकी ओर,
ईश्वर करे रास्ते में उसे पहले हम मिले।
""",
    """खुशी से बीते हर दिन
हर सुहानी रात हो,
जिस तरफ आपके कदम पड़े
फूलों की बरसात हो।
जन्मदिवस की शुभकामनाये...!
""",
    """ल से मेरी दुआ है के खुश रहो तुम,
मिले न कोई गम जहाँ भी रहो तुम,
समंदर की तरह दिल है गहरा तुम्हारा,
सदा खुशी से भरा रहे दामन तुम्हारा।
""",
    """ये दिन ये महिना ये तारीख जब जब आयी,
हमने प्यार से जन्मदिन की महफ़िल सजाई,
हर शमा पर नाम लिख दिया दोस्ती का,
इसकी रौशनी में चाँद जैसी तेरी सूरत समाई।
""",
    """आँखें खोलो भगवान का नाम लो,
सांस लो ठंडी हवा का जाम लो,
""",
    """आसमान का चाँद तेरी बाहों में हो;
तू जो चाहे तेरी राहों में हो;""",
    """हर वो ख्वाब हो पूरा जो तेरी आँखों में हो;
खुश किस्मती की हर लकीर तेरे हाथो में हो।
तह दिल से बहुत सारी शुभकामनाएं।
""",
    """भीगे मौसम की खुशबु हवाओं में है;
आपके साथ का एहसास इन फिजाओं में है;
""",
    """यूहीं सदा रहे आपके होंठो पर मुस्कुराहट;
इतना असर तो मेरी दुआओं में है।
""",
  ];
  static List dosti = [
    """यारों की यारी भी खिचड़ी से कम नहीं,
स्वाद भले ही न रहे पर
कमबख्त भूख मिटा देती है।
""",
    """तेरी मेरी दोस्ती इतनी खास हो,
की दुनिया कहे काश ऐसा
दोस्त मेरे पास हो।
""",
    """रिश्तो से बड़ी कोई चाहत नही होती,
और दोस्ती से बड़ी कोई इबादत नही होती।
""",
    """सच्चे दोस्तो को
सुख दुख की पहचान होती है,
तभी तो जमाने में
दोस्ती महान होती है।
""",
    """हमारी दोस्ती एक-दूजे से ही पूरी है,
वरना रास्ते के बिना तो मंज़िल भी अधुरी है।
""",
    """ना कोई Ex है, ना कोई Next है,
ज़िन्दगी जीता हूं शान से
क्योंकि मेरे लिए तो मेरे दोस्त ही बेस्ट है।
""",
    """बच्चे वसीयत पूछते है ,रिश्ते हैशियत पूछते है,
वो दोस्त ही है जो मेरी खैरियत पूछते है।
// """,
    """अपनी जिंदगी के अलग असूल है,
या की खातिर तो कांटे भी कबूल है।""",
    """ प्यार और शोहरत सब तुझ पर कुर्बान है,
तू सिर्फ मेरा दोस्त नही है,
मेरे धड़कन की जान है।
""",
    """लिफाफे में पड़े वो खत अब पुराने हो गए,
सच्चे दोस्तो से मिले अब हमे जमाने हो गए।""",
    """सच्चे दोस्त हमे कभी गिरने नही देते हैं,
न किसी की नज़रो में ना किसी के कदमो में।
""",
  ];

  static List majedar = [
    """   ना इश्क़ करो झूठा, ना प्यार करो फर्जी,
आगे नहीं बताऊंगा, मेरा शेर मेरी मर्ज़ी!!
""",
    """उसने कहा मेरे दिल में तेरे लिए कोई जगह नहीं
मैंने कहा दीमाग में रख लो वह तो खाली है|
""",
    """ हे ऊपरवाले थोडी महिमा दिखा दे
जो reply  ना दे उसके फोन का Display  उड़ा दे
""",
    """ ज़िंदगी ने दिए हैं बहुत से धोखे
but
कोई बात नहीं its ok
""",
    """ मन चाहा जीवनसाथी और जनरल डिब्बे में सीट
सिर्फ किस्मत वालों को ही मिलती है
""",
    """इस गर्मी की वजह से हालात ऐसे हो गये हैं कि
आजकल तजुरबा लिखा हुआ भी पढ़ने में तरबूजा ही आता है
""",
    """र्ज किया है
गुजर रहें है आज हम उस मुकाम से
लोग छोड़ रहें हैं साथ जरा से जुकाम से""",
    """इस कदर उधार ले-ले कर खाया है हमने
कि दुकानदार भी हमारी जिंदगी की दुआ करते हैं
""",
    """ कभी तो आएगी बेवफा मेरी कब्र पर
टांग पकड़ कर अंदर ना खींच लिया तो कहना""",
    """आपकी सूरत मेरे दिल में ऐसे बस गयी है
जैसे छोटे से दरवाजे में भैंस फंस गयी है..।
""",
    """ हां खुदा है, वहां खुदा है,
आस पास खुदा ही खुदा है,
और जहां खुदा नहीं है, वहां कल खुदेगा
नगरपालिका............!!!
""",
    """ तुझे पाने के लिए कुछ भी कर सकता हूँ...
तेरे प्यार में जी और मर भी सकता हूँ...!!!
फिर भी तू नहीं मिली तो कोई गम नहीं.....
ये फार्मूला किसी और पर भी ट्राई कर सकता हूँ..!!
""",
  ];

  static List god = [
    """ ढूंढ लूँगा तुम्हें आँखें बन्द करके भी मेरे कन्हैया जी, 
    रूहानियत वाले मोहब्बत को नजरों की जरूरत नहीं होती…!! जय श्री राधे कृष्णा""",
    """ मेरे जिस्म जान में बस नाम तुम्हारा है मेरे श्याम,
     आज अगर मैं खुश हूँ तो यह अहसास भी तुम्हारा है…!! जय श्री राधे श्याम""",
    """ तुम हो तो मैं हूँ साँवरे दिल में मेरे तुम बसते हो,
     अब और कहीं नहीं जाना तुम्हें छोड़कर, इस जिंदगी की हर साँस में तुम हो साँवरे…!! जय श्री श्याम""",
    """   देवो के देव, महादेव आपसे हैं विनती, 
    मेरी भी हो, आपके ख़ास भगतो में गिनती…!!""",
    """ कैसे कह दू की मेरी हर दुआ बेअसर हो गयी,
     मै जब जब भी रोया मेरे भोलेनाथ को खबर हो गयी…!!""",
    """ तेरा हाथ सिर पे होने से मेरे सब काम साकार होते हैं,
    मैं जहाँ भी देखता हूँ तुझे मेरे मोहन मुझे तो बस तेरे दीदार होते हैं…!!""",
    """ सबसे बड़ा तेरा दरबार है, तू ही सब का पालनहार है, सजा दे या माफी महादेव,
     तू ही हमारी सरकार है…!! हर हर महादेव""",
    """ सागर मथ के सभी देवता अमृत पर ललचाए,
     तुम अभ्यंकर विष को पीकर नीलकंठ कहलाए…!!""",
    """नियत अच्छी हो तो, भक्ति भी सच्ची होती हैं, 
    भगवान हर हृदय में हैं, घरों में रखने की जरूरत नही होती हैं…!!""",
  ];
  static List prerna = [
    """“बुझी शमा भी जल सकती है,
तूफान से कश्ती भी निकल सकती है,
हो के मायूस ना यू,अपने इरादे बदल,
तेरी किस्मत कभी भी बदल सकती है.”""",
    """“कितनी आसान थी जिन्दगी तेरी राहें,
मुश्किलें हम खुद ही खरीदते है,
और कुछ मिल जाये तो अच्छा होता,
बहुत पा लेने पर भी यही सोचते है.”""",
    """“आओ झुक कर सलाम करे उन्हें,
जिनकी जिंदगी में ये मुकाम आया है.
किस कदर खुशनसीब है वो लोग,
जिनका लहू देश के काम आया है.”""",
    """“मंजिल उन्ही को मिलती है,
जिनके सपनो में जान होती है,
पंख से  कुछ नहीं होता,
हौसलो से उड़ान होती है.”""",
    """सोच को बदलो, सितारे बदल जायेंगे
नजर को बदलो, नज़ारे बदल जायेगे,
कश्तियाँ बदलने की जरुरत नहीं,
दिशाओं को बदलो, किनारे बदल जायेंगे।”""",
    """“लहरों की रवानी देख कर यह न समझाना,
कि समंदर में रवानी नहीं है,
जब भी उठेंगे तूफान बन के उठेंगे,
अभी हमने उठने की ठानी नहीं है.”""",
    """जिंदगी में बार बार सहारा नहीं मिलता,
बार-बार कोई प्यार से प्यारा नहीं मिलता।
तुम्हारे जो पास है उसे संभाल के रखना,
खो कर वो फिर कभी दुबारा नहीं मिलता ।""",
    """सपने सच होंगे।
पर इस के लिए पहले आपको
सपने देखने होंगे।""",
    """वक्त से लड़कर जो नसीब बदल दे,
इंसान वही जो अपनी तकदीर बदल दे,
कल क्या होगा कभी मत सोचो,
क्या पता कल वक्त खुद अपनी तस्वीर बदल !""",
  ];
  static List jivan = [
    """जिंदगी में प्यार सभी को होता हैं
हर किसी के दिल में कोई शख्स बैठा होता हैं
नसीब वाले होते हैं वो लोग
जिनके जीवन में साथ उनका होता हैं""",
    """हर गलती की सजा देती हैं जिन्दगी
लेकिन साथ रहकर सहती भी हैं जिन्दगी
ख़ुशी हो या गम अपनाती हैं जिन्दगी
हर पल साथ निभाती हैं ज़िन्दगी""",
    """ शान-ए-जिन्दगी वही
जब कोई तुमसे से दुखी नहीं
खुद भी हँसो और दुसरो को हंसाओ
इसी ताल में जिन्दगी जी जाओ""",
    """ जीवन का सच कड़वा हैं
यहाँ कोई पल नहीं ठहरा हैं
आज जिव की रफ़्तार तेज हो गई
भगा दौड़ी में जिन्दगी कहीं खो गई हैं""",
    """आज हम है तेरे साथ
कम हमारी यादे होंगी तेरे पास
कभी पन्ने पलट लेना उन यादों के
वादा हैं तुझे बरस उठेंगे हम तेरी आँखों से""",
    """आज हम है तेरे साथ
कम हमारी यादे होंगी तेरे पास
कभी पन्ने पलट लेना उन यादों के
वादा हैं तुझे बरस उठेंगे हम तेरी आँखों से""",
    """ जीवन की राहो में हम साथ तेरा ढूंढते हैं
तेरे ख्यालो में हम अक्सर ही खो जाते हैं
कैसे जियेंगे इस जीवन में तेरे बिन
हम तो बिना तेरे साँस भी ना ले पाते हैं""",
    """जब जीना ही हैं जिन्दगी को
तो क्यूँ पल-पल आँसू बहाये
एक बार हँसकर गले तो लगाओ गम को
ये गम आने से ही शरमाये""",
  ];
  static List mahobbat = [
    """सफर वही तक जहाँ तक तुम हो,
नज़र वही तक जहाँ तक तुम हो,
वैसे तो हज़ारों फूल खिलतें हैं गुलशन में मगर,
खुशबू वही तक जहाँ तक तुम हो।""",
    """तेरे नज़रों के तीर इतने शातिर है,
की पता ही नही चलता किस के खातिर हैं।""",
    """मेरे बजूद में काश तू उतर जाए,
मैं देखूं आईना और तू नज़र आये,
तू हो सामने और ये वक्त ठहर जाए,
और ये जिंदगी तुझे देखते हुए गुज़र जाए।""",
    """नज़रो को तेरे प्यार से इंकार नही है,
अब मुझे किसी और का इंतज़ार नही है,
मैं खामोश हूँ तो वो वजूद है मेरा,
लेकिन तुम ये न समझना मुझे तुमसे प्यार नही है।""",
    """चाँद से चाँदनी होती है सितारों से नही,
और प्यार एक से होता है हजारो से नही।""",
    """क्यों किसी से इतना प्यार हो जाता है,
एक दिन का भी इंतज़ार दुष्वार हो जाता है,
अपने भी लगने लगते हैं पराये,
जब एक अजनबी पर एतवार हो जाता है।""",
    """मैं यूँ मिलूँ तुझसे की तेरा लिबास बन जाऊँ,
तुझे बना कर समंदर खुद प्यास बन जाऊँ,
आज पहलू में टूट कर बिखर जाऊँ,
कल को शायद मुमकिन नही हो मैं तुझको पाऊँ।""",
    """भंवर से निकल कर एक किनारा मिला है,
जीने को फिर एक सहारा मिला है,
बहुत कश्मकश में थी ये जिंदगी मेरी,
अब इस जिंदगी में साथ तुम्हारा मिला है।""",
    """एक सपने की तरह सजा कर रखु
अपने इस दिल में हमेशा छुपा कर रखु
मेरी तक़दीर मेरे साथ नहीं वर्ना
ज़िंदगी भर के लिए उसे अपना बना कर रखु।""",
    """हर पर्वत को झुका नही सकते,
हर दरिया को सुखा नही सकते,
तुम हमे भूल जाओ भले ही,
लेकिन हम तुम्हे कभी भुला नही सकते।""",
    """मीठी मीठी यादे पलकों पे सजा लेना
एक साथ गुज़ारे पल को दिल में बसा लेना
नज़र ना आऊं हकीकत में अगर
मुस्कुरा कर मुझे सपनो में बुला लेना।""",
    """ख़ामोशी इकरार से कम नहीं होती
सादगी भी सिंगार से कम नहीं होती
ये तो अपना अपना नज़रिया है मेरे दोस्त
वर्ना दोस्ती भी प्यार से कम नहीं होती।""",
    """कोई चाँद से मोहब्बत करता है,
कोई सूरज से मोहब्बत करता है,
हम उनसे मोहब्बत करते हैं,
जो हमसे मोहब्बत करता है।""",
    """तरसती नज़रो ने हर पल आपको ऐसे मांगा
जैसे हर अमावस में चांद मांगा
रूठ गया वो खुदा भी हमसे
जब हमने अपनी हर दुआ में आपको मांगा ।""",
    """हर फैसला किया नही जाता सिक्का उछाल के,
ये दिल का मामला होता है जरा देख-भाल के
तुम क्या जानो हमे तुमसे कितनी मोहब्बत है,
कहो तो अभी रख दूँ अपना कलेजा निकाल के।""",
    """धीरे से आकर हमारे दिल में उतर जाते हो,
खुशबू की तरह मेरी सांसो में बिखर जाते हो,
अब तो तुम्हारे इश्क में ये हाल हो गया है,
सोतें जागते बस तुम ही तुम नजर आते हो।""",
  ];
  static List yade = [
    """ ख़्वाब आँखों से चुराना मेरी आदत नहीं,
किसी अपने को भुलाना मेरी आदत नहीं,
पलकें भिगो लेता हूँ अपनों की याद में,
मगर किसी को रूलाना मेरी आदत नहीं।""",
    """ मालूम भी है कि ये मुमकिन नहीं मगर,
एक आस सी रहती है कि वो याद करेगा।""",
    """ मैं बहुत ख़ुश था कड़ी धूप के सन्नाटे में,
क्यों तेरी याद का बादल मेरे सिर पर आया।""",
    """ तुम्हारी याद में जीने की आरज़ू है अभी,
कुछ अपना हाल संभालूँ अगर इजाज़त हो।""",
    """ नहीं है कुछ भी मेरे दिल में सिवा उसके,
मैं उसे अगर भुला दूँ तो याद क्या रखूँ।""",
    """ कुछ खूबसूरत पलों की महक सी हैं तेरी यादें,
सुकून ये भी है कि ये कभी मुरझाती नहीं।""",
    """ अहसास मिटा,तलाश मिटी, मिट गई उम्मीदें भी,
सब मिट गया पर जो न मिट सका वो है यादें तेरी।""",
    """बैठे थे अपनी मस्ती में कि अचानक तड़प उठे,
आ कर तुम्हारी याद ने अच्छा नहीं किया।""",
    """ नहीं फुर्सत यकीं मानो हमें कुछ और करने की,
तेरी यादें तेरी बातें बहुत मसरूफ़ रखती हैं।""",
    """ सरहदें तोड़ के आ जाती है किसी पंछी की तरह,
ये तेरी याद है जो बंटती नहीं मुल्कों की तरह।""",
    """ हर रात रो-रो के उसे भुलाने लगे,
आँसुओं में उसके प्यार को बहाने लगे,
ये दिल भी कितना अजीब है कि,
रोये हम तो वो और भी याद आने लगे।""",
    """ भूल जाना उसे मुश्किल तो नहीं है लेकिन,
काम आसान भी हमसे कहाँ होते हैं।""",
  ];
  static List other = [
    """तुम हकीकत हो या फरेब मेरी आँखों का,
न दिल से निकलते हो न जिंदगी में आते हो।""",
    """नहीं पसंद मोहब्बत में मिलावट मुझको,
अगर वो मेरा है तो ख्वाब भी बस मेरे देखे।""",
    """दौलत की चाह थी तो कमाने निकल गए,
दौलत मिली तो हाथ से रिश्ते निकल गए,
बच्चों के साथ रहने की फुर्सत न मिल सकी,
फुर्सत मिली तो बच्चे ही घर निकल गए।""",
    """मुझे किस्मत से शिकवा तो नहीं लेकिन ऐ खुदा,
वो ज़िन्दगी में क्यों आया जो किस्मत में नहीं था।""",
    """मोहब्बत हार के जीना बहुत मुश्किल होता है,
उसे बस इतना बता देना भरम तोड़ा नहीं करते।""",
    """गुजरती बेक़रारी में न कम कर उम्र फिर सारी,
कि हम भूले से कर बैठे मोहब्बत एक बेदिल से।""",
    """दूर हो जाएँ तो जरा इंतज़ार कर लेना,
अपने दिल में इतना तो ऐतबार कर लेना,
लौट के आयेंगे हम अगर कहीं चले भी गए,
आप बस हमसे दोस्ती बरकरार कर लेना।""",
    """न तुम्हें होश रहे और न मुझे होश रहे,
इस क़दर टूट के चाहो मुझे पागल कर दो।""",
    """चमका न करो जुगनू की तरह रात को,
ले जाउंगा मुट्ठी में किसी रोज़ छुपा कर।""",
    """जाले अपनी यादों के हमारे साथ रहने दो 
न जाने किस गली में ज़िंदगी की शाम हो जाए """,
    """और भी दुख हैं ज़माने में मोहब्बत के सिवा 
राहतें और भी हैं वस्ल की राहत के सिवा """,
    """रंजिश ही सही दिल ही दुखाने के लिए आ 
आ फिर से मुझे छोड़ के जाने के लिए आ """,
  ];
  static List rajneeti = [
    """राजनीति का काम समाज के लिए
विकास और उन्नति के लिए नीतियां बनाना है
लेकिन नेताओं ने राजनीति को
राज करने की नीति तक सीमित कर दिया है
""",
    """
नेता अपनी राजनीति में मशग़ूल है
ग़रीब के मुद्दे इनके लिए फ़िज़ूल है
अपनी कुर्सी बचाने के लिए
नेताओं को देश का सौदा कबूल है""",
    """
चोर, बेईमान और भ्रष्ट नेताओं की क्यों करते हो बात,
लोकतंत्र की ताकत है जनता में, दिखला दो इनकी औकात.""",
    """मूल जानना बड़ा कठिन हैं नदियों का, वीरो का,
धनुष छोड़कर और गोत्र क्या होता हैं रणधीरो का,
पाते हैं सम्मान तपोबल से भूतल पर शूर,
“जाति-जाति” का शोर मचाते केवल कायर, क्रूर.""",
    """जहाँ सच हैं, वहाँ पर हम खड़े हैं,
इसी खातिर आँखों में गड़े हैं.""",
    """नेता की बातों में सच्चाई का अभाव होता है,
झूठ बोलना तो इनका स्वभाव होता हैं.""",
    """मैं अपनी आँख पर चशमाँ चढ़ा कर देखता हूँ
हुनर ज़ितना हैं सारा आजमा कर देखता हूँ
नजर उतना ही आता हैं की ज़ितना वो दिखाता है
मैं छोटा हू मगर हर बार कद अपना बढ़ा कर देखता हूँ""",
    """मुझको तमीज की सीख देने वाले,
मैंने तेरे मुँह में कई जुबान देखा है,
और तू इतना दिखावा भी ना कर अपनी झूठी ईमानदारी का
मैंने कुछ कहने से पहले अपने गिरेबां में देखा है.""",
    """
सियासत की रंगत में ना डूबो इतना,
कि वीरों की शहादत भी नजर ना आए,
जरा सा याद कर लो अपने वायदे जुबान को,
गर तुम्हे अपनी जुबां का कहा याद आए.

""",
    """न मस्जिद को जानते हैं,
न शिवालो को जानते हैं,
जो भूखे पेट हैं,
वो सिर्फ निवालों को जानते हैं.

""",
    """क्या खोया, क्या पाया जग में,
मिलते और बिछुड़ते मग में,
मुझे किसी से नही शिकायत
यद्यपि छला गया पग-पग में.""",
    """इस नदी की धार में ठंडी हवा तो आती हैं,
नाव जर्जर ही सही, लहरों से टकराती तो हैं.""",
    """हमारी रहनुमाओ में भला इतना गुमां कैसे,
हमारे जागने से, नींद में उनकी खलल कैसे.""",
  ];
  static List love = [
    """सफर वही तक जहाँ तक तुम हो,
नज़र वही तक जहाँ तक तुम हो,
वैसे तो हज़ारों फूल खिलतें हैं गुलशन में मगर,
खुशबू वही तक जहाँ तक तुम हो।""",
    """तेरे नज़रों के तीर इतने शातिर है,
की पता ही नही चलता किस के खातिर हैं।""",
    """मेरे बजूद में काश तू उतर जाए,
मैं देखूं आईना और तू नज़र आये,
तू हो सामने और ये वक्त ठहर जाए,
और ये जिंदगी तुझे देखते हुए गुज़र जाए।""",
    """नज़रो को तेरे प्यार से इंकार नही है,
अब मुझे किसी और का इंतज़ार नही है,
मैं खामोश हूँ तो वो वजूद है मेरा,
लेकिन तुम ये न समझना मुझे तुमसे प्यार नही है।""",
    """चाँद से चाँदनी होती है सितारों से नही,
और प्यार एक से होता है हजारो से नही।""",
    """क्यों किसी से इतना प्यार हो जाता है,
एक दिन का भी इंतज़ार दुष्वार हो जाता है,
अपने भी लगने लगते हैं पराये,
जब एक अजनबी पर एतवार हो जाता है।""",
    """मैं यूँ मिलूँ तुझसे की तेरा लिबास बन जाऊँ,
तुझे बना कर समंदर खुद प्यास बन जाऊँ,
आज पहलू में टूट कर बिखर जाऊँ,
कल को शायद मुमकिन नही हो मैं तुझको पाऊँ।""",
    """भंवर से निकल कर एक किनारा मिला है,
जीने को फिर एक सहारा मिला है,
बहुत कश्मकश में थी ये जिंदगी मेरी,
अब इस जिंदगी में साथ तुम्हारा मिला है।""",
    """एक सपने की तरह सजा कर रखु
अपने इस दिल में हमेशा छुपा कर रखु
मेरी तक़दीर मेरे साथ नहीं वर्ना
ज़िंदगी भर के लिए उसे अपना बना कर रखु।""",
    """हर पर्वत को झुका नही सकते,
हर दरिया को सुखा नही सकते,
तुम हमे भूल जाओ भले ही,
लेकिन हम तुम्हे कभी भुला नही सकते।""",
    """मीठी मीठी यादे पलकों पे सजा लेना
एक साथ गुज़ारे पल को दिल में बसा लेना
नज़र ना आऊं हकीकत में अगर
मुस्कुरा कर मुझे सपनो में बुला लेना।""",
    """ख़ामोशी इकरार से कम नहीं होती
सादगी भी सिंगार से कम नहीं होती
ये तो अपना अपना नज़रिया है मेरे दोस्त
वर्ना दोस्ती भी प्यार से कम नहीं होती।""",
    """कोई चाँद से मोहब्बत करता है,
कोई सूरज से मोहब्बत करता है,
हम उनसे मोहब्बत करते हैं,
जो हमसे मोहब्बत करता है।""",
    """तरसती नज़रो ने हर पल आपको ऐसे मांगा
जैसे हर अमावस में चांद मांगा
रूठ गया वो खुदा भी हमसे
जब हमने अपनी हर दुआ में आपको मांगा ।""",
  ];
  static List dard = [
    """कौन अब तेरे साथ रहेगा
तूने अच्छे अच्छे मुहाफ़िज़ छोड़े हैं
तूने जीते जागते दिल तोड़े जाना
हमने टूटे हुए शीशे भी जोड़े हैं""",
    """बोल तेरे दिल में क्या है
क्या है तेरी रज़ा बता
मैंने बस तुझे दिल से चाहा है ना
क्या है मोहब्बत की सज़ा बता""",
    """कौन तेरे झूठ को भी सच मानेगा
कौन तेरी बातों में खो जायेगा
कौन तुझे यूँ चाहेगा बोल
कौन तेरा बस यूँ हो जायेगा""",
    """किसी को दिल से चाहा ये गुनाह था
मोहब्बत तबाह करती है ये सुना था
छोड़ कर जाना आज कल रिवाज़ है
या मैंने ही शख़्स ग़लत चुना था""",
    """मौत आएगी जान जाएगी
मगर तेरा आना नहीं होगा
ये मोहब्बत तुम्हारा काम नहीं
तुमसे ये इश्क़ निभाना नहीं होगा""",
    """दर्द, ज़ख्म, सुकून नहीं है
मेरी तरह इश्क़ का जूनून नहीं है
मोहब्बत बहती है रगों में मेरी
रगों में मेरी ख़ून नहीं""",
    """चेहरे पे हिजाब आँखों में शर्म
तेरे हर किरदार की बात और हैं
मुझे देखे तू मेरा ऐसा नसीब कहाँ
सुना है तेरे चाहने वाले और हैं""",
    """तेरे गुनाह एक तरफ मेरी गलती एक तरफ
तेरे सताए आशिक़ों की बस्ती एक तरफ
सब पागल हो गए मेरा हाल देखकर
मेरे आंसू एक तरफ मेरी हसी एक तरफ""",
    """तेरा होकर भी मैं तनहा ही रहा
मुझे तन्हाइयों की आदत हो गयी
सोच तेरे नाम पर मिट जाने वाले को
क्यों तेरे ही नाम से नफरत हो गयी""",
    """जो तेरे साथ रहे तो मेरे खिलाफ रहे
फिर मेरे साथ रहे तो तेरे खिलाफ रहे
ऐसे लोगों का हिसाब ख़ुदा अलग से करेगा""",
    """अगर तुम्हारे पास है वक़्त ही नहीं
क्या करूँ मैं अपने हालात बताकर
ये मेरी मोहब्बत एक तरफ़ा ही है
क्या करूँ मैं अपने जज़्बात बताकर
""",
    """कैसे मानूं उसे इश्क़ है मुझसे
खुश देखा है मैंने उसे मुझसे जुदा होकर
बहुत मुश्किल होता है खुदको समेटना
देखना तुम भी कभी खुद में तबाह होकर

""",
    """कोई उसे ठंडी हवा कहता है
कोई उसकी पायल पे मरता है
उसे सब सबसे बेहतर मानते हैं
चाँद भी उसे सलाम करता है""",
  ];
  static List sharab = [
    """हर बार सोचता हूँ
छोड़ दूंगा मैं पीना अब से,
मगर तेरी आड़ आती है
और हम मयखाने को चल पड़ते हैं।""",
    """मिलावट है तेरे इश्क में
इत्र और शराब की,
कभी हम महक जाते हैं
कभी हम बहक जाते हैं""",
    """नतीजा बेवजह महफिल से उठवाने का क्या होगा,
न होंगे हम तो साकी तेरे मैखाने का क्या होगा।""",
    """तेरी आँखों के ये जो प्याले हैं,
मेरी अंधेरी रातों के उजाले हैं,
पीता हूँ जाम पर जाम तेरे नाम का,
हम तो शराबी बे-शराब वाले हैं.""",
    """आए थे हँसते खेलते मय-ख़ाने में ‘फ़िराक़’
जब पी चुके शराब तो संजीदा हो गए

""",
    """उन्हीं के हिस्से में आती है ये प्यास अक्सर,
जो दूसरों को पिलाकर शराब पीते हैं.

""",
    """ग़म इस कदर बढ़े कि घबरा के पी गया,
इस दिल की बेबसी पे तरस खा के पी गया,
ठुकरा रहा था मुझे बड़ी देर से ज़माना,
मैं आज सब जहान को ठुकरा के पी गया।""",
    """तुम क्या जानो शराब कैसे पिलाई जाती है,
खोलने से पहले बोतल हिलाई जाती है,
फिर आवाज़ लगायी जाती है आ जाओ टूटे दिल वालों,
यहाँ दर्द-ए-दिल की दवा पिलाई जाती है।

""",
    """कहीं सागर लबालब हैं कहीं खाली पियाले हैं,
यह कैसा दौर है साकी यह क्या तकसीम है साकी।

""",
    """मेरी तबाही का इल्जाम अब शराब पर है,
करता भी क्या और तुम पर जो आ रही थी बात।

""",
    """यूँ बिगड़ी बहकी बातों का
कोई शौक़ नही है मुझको,
वो पुरानी शराब के जैसी है
असर सर से उतरता ही नहीं।

""",
    """तुम आज साक़ी बने हो तो शहर प्यासा है,
हमारे दौर में ख़ाली कोई गिलास न था।""",
    """हर किसी बात का जवाब नहीं होता
हर जाम इश्क में ख़राब नहीं होता
यूँ तो झूम लेते है नशे में रहने वाले
मगर हर नशे का नाम शराब नहीं होता..

""",
    """अब तो उतनी भी बाकी नहीं मय-ख़ाने में,
जितनी हम छोड़ दिया करते थे पैमाने में।

""",
  ];
  static List bewafa = [
    """वफादार और तुम….??
ख्याल अच्छा है🤔
बेवफा और हम…??
इल्जाम भी अच्छा है""",
    """तराजू मोहब्बत का था,
बेवफाई भारी पड गयी!!""",
    """कितने आसान लफ्जों मे
कह गई मुझे,
सिर्फ दिल ही तोड़ा है
कौन-सी जान ले ली तेरी!!""",
    """एक दिन ऐसा भी आया
जिन्दगी में की,
मैंने तेरा नाम सुनकर
मुस्कुराना छोड़ दिया !!""",
    """COPY
गलत लोग तो
सभी के जीवन में आते है,
लेकिन सीख हमेसा
सही ही देकर जाते है""",
    """सुनो
वफ़ा की शर्त ना रखो,
मुझे तुम हारते हुए अच्छे नही लगते""",
    """याद न कीया कर तु मुझे
बेवफाई करके
साथ छोड़ना ही था तो
दिल लगाया क्युं""",
    """तेरा ख्याल
दिल से मिटाया नहीं अभी
बेवफा तुझे
दिल से भुलाया नही अभी""",
    """दिल में आया था कोई,
जल्दी में था
इसलिए चला गया।""",
    """डूबी है मेरी उंगलिया खुद
अपने लहू में,
ये कांच के टुकडो को
उठाने की सजा है !!""",
    """मुझको छोड़ने की
वजह तो बता देते,
मुझसे नाराज थे
या मुझ जैसे हजारों थे""",
    """एक बार ही कहा होता की
हम किसी और के भी है
खुदा कसम
हम तेरे साये से भी दूर रहते !!""",
    """क्या ज़रुरत थी
चोट-ए-बेवफाई की,
नादान दिल
झूठे वादों में ही खुश था !!""",
    """हर कोई तेरे आशियाने का
पता पूछता है,
न जाने किस किस से वफा के
वादे किये है तूने !!""",
  ];
  static List birthday = [
    """हर ख़ुशी ख़ुशी मांगे आपसे,
जिंदगी जिंदा दिली मांगे आपसे,
उजाला हो मुक़द्दर में आपके इतना,
की चाँद भी रोशनी मांगे आपसे
Happy Birthday""",
    """तोहफा मैं तुझे आज मेरा दिल ही देता हूँ,
ये हसीन मोका गवाना नहीं चाहता हूँ,
अपने दिल की बात तुम्हारे सामने बतलाता हूँ,
और तुम्हारे जन्म दिन की शुभ कामनाये देता हूँ""",
    """जन्मदिन के ये ख़ास लम्हें मुबारक,
आँखों में बसे नए ख्वाब मुबारक,
जिंदगी जो लेकर आई है आपके लिए आज..
वो तमाम खुशियों की हंसीं सौगात मुबारक!!!""",
    """दीपक में अगर नूर न होता,
तनहा दिल इतना मजबूर न होता,
हम आपको खुद बर्थडे विश करने आते,
अगर आपका आशियाना इतनी दूर न होता।""",
    """चेहरा आपका खिला रहे गुलाब की तरह,
नाम आपका रोशन रहे आफताब की तरह,
ग़म में भी आप हँसते रहे फूलों की तरह,
अगर हम इस दुनिया में न रहें आज की तरह""",
    """फूलो सा महकता रहे
हमेशा जीवन तुम्हारा
खुशिया चूमे कदम तुम्हरे
बहुत सारा प्यार और आशीर्वाद हमारा""",
    """दुआ मिले बन्दों से खुशियां मिले जग से,
साथ मिले अपनों से रेहमत मिले रब से,
ज़िन्दगी में आप को बे पनाह प्यार मिले,
खुश रहे आप दुनिया में ज्यादा सुब से""",
    """इतनी खुशियाँ दे आपको आने वाला कल
तमन्नाओ से भरी हो ज़िन्दगी खुशियों से भरा हो हर पल
दामन भी छोटा लगने लगे
इतनी खुशियाँ दे आपको आने वाला कल
!!Happy Birthday!!""",
    """दुआएं खुशिया मिले आपको,
खुदा से रहमत और प्यार मिले आपको,
आपके होठों पर बनी रहे हमेशा मुस्कान
इतनी खुशिया मिले आपको""",
    """दिल से मेरी दुआ है कि खुश रहो तुम,
मिले न कोई गम जहाँ भी रहो तुम,
समंदर की तरह दिल है गहरा तुम्हारा,
सदा खुशियों से भरा रहे दामन तुम्हारा।
 !!Happy Birthday!!""",
    """निकलता हुआ सूरज दुआ दे आपको,
खिलता हुआ फूल खुशबू दे आपको,
हम तो कुछ देने के काबिल नहीं,
खुदा हज़ार खुशियां दे आपको..
!!हैप्पी बर्थडे!!""",
    """तोहफा ए दिल दें दूँ, या दें दूँ चाँद तारे;
जन्मदिन पर तुझे क्या दूँ, ये पूछे मुझसे सारे;
ज़िंदगी तेरे नाम कर दूँ भी तो कम है,
दामन में भर दूँ हर पल ख़ुशी के मैं तुम्हारे..
जन्मदिन की शुभकामनाएं""",
    """मैं लिख दू तुम्हारी उम्र चाँद सितारों से…
मैं मनाऊ जन्मदिन तुम्हारा फूल बहारों से
ऐसी खूबसूरती दुनिया से लेकर आऊ मैं
की सारी महफ़िल सज जाए हसीन नजारो से
आपको दिल से जन्मदिन मुबारक हो""",
    """दिल से मेरी दुआ है कि खुश रहो तुम,
मिले न कोई गम जहाँ भी रहो तुम,
समंदर की तरह दिल है गहरा तुम्हारा,
सदा खुशियों से भरा रहे दामन तुम्हारा।
 !!Happy Birthday!!""",
    """यही दुआ करता हूँ खुदा से,
आपकी जिंदगी में कोई गम न हो,
जन्मदिन पर मिले हजारों खुशियाँ,
चाहे उनमें शामिल हम न हों।""",
    """आपकी पसंद हमारी चाहत बन जाये,
आपकी मुस्कान दिल की राहत बन जाये,
खुदा खुशियों से इतना खुश करदे आपको,
कि आपको खुश देखना हमारी आदत बन जाये।""",
  ];
  static List holi = [
    """खुशियाँ कभी न हो कम, बिखरे होली के ऐसे रंग.
सदा खुश रहें आप अपनों के संग.
आपको होली की बहुत बहुत शुभकामनायें!""",
    """सोंचा किसी अपने को याद करे
अपने किसी ख़ास को याद करे
किया है हमने फैसला होली मुबारक कहने का
दिल ने कहा क्यों ना आपसे शुरुआत करे
होली की हार्दिक शुभकामनाएं""",
    """बसंत रितु की है बहार
चली पिचकारी उड़ा है गुलाल
रंग बरसे हैं नीले हरे लाल
मुबारक हो आपको होली का त्यौहार""",
    """भांग की खुशबु, ठंडाई की मिठास
छोटों की हुडदंग बड़ों का प्यार
मुबारक हो आपको रंगों का त्यौहार""",
    """चन्दन की खुशबू
रेशम का हार
फागुन की फुहार
रंगो की बहार
दिल की उमीदें
अपनों का प्यार
मुबारक़ हो आपको होली का त्यौहार""",
    """लाल गुलाबी रंग है झूम रहा संसार
सूरज की किरण खुशियों की बहार
चाँद की चांदनी अपनों का प्यार
शुभ हो आपको होली का त्यौहार""",
    """हमेशा मीठी रहे आपकी बोली,
खुशियों से भर जाये आपकी झोली,
आप सबको मेरी तरफ से हैप्पी होली""",
    """वो पानी की बौछार वो गुलाल की फुहार
वो घरों से निकलना वो गलियों में घूमना
वो दोस्तों की धूम वो गोविन्दाओं का हुजूम
हो जाओ Ready Holi is coming soon
WISHING U A VERY HAPPY HOLI…""",
    """प्यार के रंग से भरो पिचकारी
स्नेह के रंग से रंग दो दुनिया सारी
ये रंग ना जाने कोई जात ना कोई बोली
आपको एडवांस में हैप्पी होली""",
    """रंगों के त्यौहार में सभी रंगों की हो भरमार
ढेर सारी खुशियों से भरा हो आपका संसार
यही दुआ है भगवान से हमारी हर बार
होली मुबारक हो मेरे यार""",
    """पिचकारी की धार, गुलाल की बौछार,
अपनों का प्यार,यही है यारों होली का त्यौहार.
हैप्पी होली!!!!""",
    """गुल ने गुलशन से गुलफान भेजा है
सितारों ने आसमान से सलाम भेजा है
मुबारक हो आप को होली का त्यौहार
हमने दिल से ये पैगाम भेजा है
होली की हार्दिक शुभकामनाएं

""",
    """प्यार के रंगों से भरो पिचकारी,
स्नेह के रंगों से रंग दो दुनिया सारी
ये रंग न जाने न कोई जात न बोली,
सबको हो मुबारक ये हैप्पी होली!""",
  ];
  static List<Color> mycolor = [
    Colors.lightBlue,
    Colors.pink,
    Colors.green,
    Colors.cyan,
    Colors.teal,
    Colors.deepPurple,
    Colors.purple,
    Colors.deepOrangeAccent,
    Colors.brown,
    Colors.red,
    Colors.blue,
    Colors.lightGreenAccent,
    Colors.black,
    Colors.orange,
    Colors.white60,
    Colors.purple,
    Colors.lightGreen,
    Colors.yellow,
    Colors.lime,
    Colors.blue,
    Colors.grey,
    Colors.brown,
    Colors.red,
    Colors.blue,
    Colors.lightGreenAccent,
    Colors.black,
    Colors.orange,
    Colors.white60,
    Colors.purple,
    Colors.lightGreen,

  ];

  static List font_style = [];
  // static List<Color> backcolor = [
  //   Colors.lightBlue,
  //   Colors.pink,
  //   Colors.green,
  //   Colors.cyan,
  //   Colors.teal,
  //   Colors.deepPurple,
  //   Colors.purple,
  //   Colors.deepOrangeAccent,
  //   Colors.brown,
  //   Colors.red,
  //   Colors.blue,
  //   Colors.lightGreenAccent,
  //   Colors.black,
  //   Colors.orange,
  //   Colors.white60,
  //   Colors.purple,
  //   Colors.lightGreen,
  //   Colors.yellow,
  //   Colors.lime,
  //   Colors.blue,
  //   Colors.grey,
  //   Colors.brown,
  //   Colors.red,
  //   Colors.blue,
  //   Colors.lightGreenAccent,
  //   Colors.black,
  //   Colors.orange,
  //   Colors.white60,
  //   Colors.purple,
  //   Colors.lightGreen,
  //   Colors.yellow,
  // ];

  static List myEmogi = ["👼 🧙 ‍♀ 🤞🏻",
    "💗 💖 💘 💝",
    "😍 🥰 😘 😗",
    "💗 💖 💘 💝 💟",
    "💞 🥰 😘  💓",
    "😍 🥰 💖 💘 😘 😗",
    "❤️‍🔥  🤩 🥳",
    "😆 😅 😂 🤣",
    "😋 😛 😝 😜 🤪",
    " 😱 😨 😰 😥",
    "💞 🥰 😘  💓",
    "💗 💖 🤩 🥳 💘 💝",
    "💗 💖 💘 💝",
    "😍 🥰 😘 😗",
    "💗 💖 💘 💝 💟",
    "💞 🥰 😘  💓",
    "😍 🥰 💖 💘 😘 😗",
    "❤️‍🔥  🤩 🥳",
  ];
}
